Table of Contents
 Class HingeElement1D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Representation of hinge element 1D
[OpenModelClass("CI.StructModel.Structure.HingeElement1D,CI.StructuralElements", "CI.StructModel.Structure.IHingeElement1D,CI.BasicTypes")]
public class HingeElement1D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
HingeElement1D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 HingeTypeRX
Hinge type in dirrection round X
public HingeTypeInDirrection HingeTypeRX { get; set; }
Property Value
HingeTypeInDirrection
 HingeTypeRY
Hinge type in dirrection round Y
public HingeTypeInDirrection HingeTypeRY { get; set; }
Property Value
HingeTypeInDirrection
 HingeTypeRZ
Hinge type in dirrection round Z
public HingeTypeInDirrection HingeTypeRZ { get; set; }
Property Value
HingeTypeInDirrection
 HingeTypeX
Hinge type in dirrection X
public HingeTypeInDirrection HingeTypeX { get; set; }
Property Value
HingeTypeInDirrection
 HingeTypeY
Hinge type in dirrection Y
public HingeTypeInDirrection HingeTypeY { get; set; }
Property Value
HingeTypeInDirrection
 HingeTypeZ
Hinge type in dirrection Z
public HingeTypeInDirrection HingeTypeZ { get; set; }
Property Value
HingeTypeInDirrection
 InitialStiffnessRX
Initial stiffness rotational RX
public double InitialStiffnessRX { get; set; }
Property Value
double
 InitialStiffnessRY
Initial stiffness rotational RY
public double InitialStiffnessRY { get; set; }
Property Value
double
 InitialStiffnessRZ
Initial stiffness rotational RZ
public double InitialStiffnessRZ { get; set; }
Property Value
double
 InitialStiffnessX
Initial stiffness X dirrection
public double InitialStiffnessX { get; set; }
Property Value
double
 InitialStiffnessY
Initial stiffness Y dirrection
public double InitialStiffnessY { get; set; }
Property Value
double
 InitialStiffnessZ
Initial stiffness Z dirrection
public double InitialStiffnessZ { get; set; }
Property Value
double
 Edit this page